# ####################################################################

#  Created by Genus(TM) Synthesis Solution 20.11-s111_1 on Mon Nov 03 10:55:13 IST 2025

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

# Set the current design
current_design top

create_clock -name "CLK" -period 10.0 -waveform {0.0 5.0} [get_ports CLK]
set_clock_transition 0.2 [get_clocks CLK]
set_load -pin_load 0.2 [get_ports LED_HEART]
set_load -pin_load 0.2 [get_ports LED_PACE]
set_false_path -from [get_ports RSTn]
group_path -weight 1.000000 -name reg2reg -from [list \
  [get_cells {lif_inst/refract_cnt_reg[1]}]  \
  [get_cells {lif_inst/refract_cnt_reg[0]}]  \
  [get_cells {lif_inst/v_reg[10]}]  \
  [get_cells {lif_inst/v_reg[11]}]  \
  [get_cells {lif_inst/v_reg[12]}]  \
  [get_cells {lif_inst/v_reg[13]}]  \
  [get_cells {lif_inst/v_reg[14]}]  \
  [get_cells {lif_inst/v_reg[15]}]  \
  [get_cells {lif_inst/v_reg[16]}]  \
  [get_cells {lif_inst/v_reg[17]}]  \
  [get_cells {lif_inst/v_reg[18]}]  \
  [get_cells {lif_inst/v_reg[19]}]  \
  [get_cells {lif_inst/v_reg[1]}]  \
  [get_cells {lif_inst/v_reg[2]}]  \
  [get_cells {lif_inst/v_reg[3]}]  \
  [get_cells {lif_inst/v_reg[4]}]  \
  [get_cells {lif_inst/v_reg[0]}]  \
  [get_cells {lif_inst/v_reg[6]}]  \
  [get_cells {lif_inst/v_reg[7]}]  \
  [get_cells {lif_inst/v_reg[8]}]  \
  [get_cells {lif_inst/v_reg[9]}]  \
  [get_cells {lif_inst/v_reg[5]}]  \
  [get_cells {lif_inst/theta_reg[0]}]  \
  [get_cells {lif_inst/theta_reg[1]}]  \
  [get_cells {lif_inst/theta_reg[2]}]  \
  [get_cells {lif_inst/theta_reg[3]}]  \
  [get_cells {lif_inst/theta_reg[4]}]  \
  [get_cells {lif_inst/theta_reg[6]}]  \
  [get_cells {lif_inst/theta_reg[7]}]  \
  [get_cells {lif_inst/theta_reg[9]}]  \
  [get_cells {lif_inst/theta_reg[5]}]  \
  [get_cells {lif_inst/theta_reg[12]}]  \
  [get_cells {lif_inst/theta_reg[13]}]  \
  [get_cells {lif_inst/theta_reg[14]}]  \
  [get_cells {lif_inst/theta_reg[11]}]  \
  [get_cells {lif_inst/theta_reg[15]}]  \
  [get_cells {lif_inst/theta_reg[8]}]  \
  [get_cells {lif_inst/theta_reg[10]}]  \
  [get_cells {divcnt_reg[6]}]  \
  [get_cells {divcnt_reg[5]}]  \
  [get_cells {divcnt_reg[4]}]  \
  [get_cells {sample_addr_reg[3]}]  \
  [get_cells {divcnt_reg[3]}]  \
  [get_cells {sample_addr_reg[1]}]  \
  [get_cells {sample_addr_reg[2]}]  \
  [get_cells {divcnt_reg[2]}]  \
  [get_cells {sample_addr_reg[0]}]  \
  [get_cells {divcnt_reg[1]}]  \
  [get_cells {divcnt_reg[0]}]  \
  [get_cells {pm_inst/blank_until_reg[0]}]  \
  [get_cells {pm_inst/blank_until_reg[1]}]  \
  [get_cells {pm_inst/blank_until_reg[2]}]  \
  [get_cells {pm_inst/blank_until_reg[3]}]  \
  [get_cells {pm_inst/blank_until_reg[4]}]  \
  [get_cells {pm_inst/blank_until_reg[5]}]  \
  [get_cells {pm_inst/blank_until_reg[6]}]  \
  [get_cells {pm_inst/blank_until_reg[7]}]  \
  [get_cells {pm_inst/blank_until_reg[8]}]  \
  [get_cells {pm_inst/blank_until_reg[9]}]  \
  [get_cells {pm_inst/blank_until_reg[10]}]  \
  [get_cells {pm_inst/blank_until_reg[11]}]  \
  [get_cells {pm_inst/blank_until_reg[12]}]  \
  [get_cells {pm_inst/blank_until_reg[13]}]  \
  [get_cells {pm_inst/blank_until_reg[14]}]  \
  [get_cells {pm_inst/blank_until_reg[15]}]  \
  [get_cells {pm_inst/blank_until_reg[16]}]  \
  [get_cells {pm_inst/blank_until_reg[17]}]  \
  [get_cells {pm_inst/blank_until_reg[18]}]  \
  [get_cells {pm_inst/blank_until_reg[19]}]  \
  [get_cells {pm_inst/blank_until_reg[20]}]  \
  [get_cells {pm_inst/blank_until_reg[21]}]  \
  [get_cells {pm_inst/blank_until_reg[22]}]  \
  [get_cells {pm_inst/blank_until_reg[23]}]  \
  [get_cells {pm_inst/blank_until_reg[24]}]  \
  [get_cells {pm_inst/blank_until_reg[25]}]  \
  [get_cells {pm_inst/blank_until_reg[26]}]  \
  [get_cells {pm_inst/blank_until_reg[27]}]  \
  [get_cells {pm_inst/blank_until_reg[28]}]  \
  [get_cells {pm_inst/blank_until_reg[29]}]  \
  [get_cells {pm_inst/blank_until_reg[30]}]  \
  [get_cells {pm_inst/blank_until_reg[31]}]  \
  [get_cells {pm_inst/refract_until_reg[0]}]  \
  [get_cells {pm_inst/refract_until_reg[1]}]  \
  [get_cells {pm_inst/refract_until_reg[2]}]  \
  [get_cells {pm_inst/refract_until_reg[3]}]  \
  [get_cells {pm_inst/refract_until_reg[4]}]  \
  [get_cells {pm_inst/refract_until_reg[5]}]  \
  [get_cells {pm_inst/refract_until_reg[6]}]  \
  [get_cells {pm_inst/refract_until_reg[7]}]  \
  [get_cells {pm_inst/refract_until_reg[8]}]  \
  [get_cells {pm_inst/refract_until_reg[9]}]  \
  [get_cells {pm_inst/refract_until_reg[10]}]  \
  [get_cells {pm_inst/refract_until_reg[11]}]  \
  [get_cells {pm_inst/refract_until_reg[12]}]  \
  [get_cells {pm_inst/refract_until_reg[13]}]  \
  [get_cells {pm_inst/refract_until_reg[14]}]  \
  [get_cells {pm_inst/refract_until_reg[15]}]  \
  [get_cells {pm_inst/refract_until_reg[16]}]  \
  [get_cells {pm_inst/refract_until_reg[17]}]  \
  [get_cells {pm_inst/refract_until_reg[18]}]  \
  [get_cells {pm_inst/refract_until_reg[19]}]  \
  [get_cells {pm_inst/refract_until_reg[20]}]  \
  [get_cells {pm_inst/refract_until_reg[21]}]  \
  [get_cells {pm_inst/refract_until_reg[22]}]  \
  [get_cells {pm_inst/refract_until_reg[23]}]  \
  [get_cells {pm_inst/refract_until_reg[24]}]  \
  [get_cells {pm_inst/refract_until_reg[25]}]  \
  [get_cells {pm_inst/refract_until_reg[26]}]  \
  [get_cells {pm_inst/refract_until_reg[27]}]  \
  [get_cells {pm_inst/refract_until_reg[28]}]  \
  [get_cells {pm_inst/refract_until_reg[29]}]  \
  [get_cells {pm_inst/refract_until_reg[30]}]  \
  [get_cells {pm_inst/refract_until_reg[31]}]  \
  [get_cells {pm_inst/tick_reg[0]}]  \
  [get_cells {pm_inst/tick_reg[1]}]  \
  [get_cells {pm_inst/tick_reg[2]}]  \
  [get_cells {pm_inst/tick_reg[3]}]  \
  [get_cells {pm_inst/tick_reg[4]}]  \
  [get_cells {pm_inst/tick_reg[5]}]  \
  [get_cells {pm_inst/tick_reg[6]}]  \
  [get_cells {pm_inst/tick_reg[7]}]  \
  [get_cells {pm_inst/tick_reg[8]}]  \
  [get_cells {pm_inst/tick_reg[9]}]  \
  [get_cells {pm_inst/tick_reg[10]}]  \
  [get_cells {pm_inst/tick_reg[11]}]  \
  [get_cells {pm_inst/tick_reg[12]}]  \
  [get_cells {pm_inst/tick_reg[13]}]  \
  [get_cells {pm_inst/tick_reg[14]}]  \
  [get_cells {pm_inst/tick_reg[15]}]  \
  [get_cells {pm_inst/tick_reg[16]}]  \
  [get_cells {pm_inst/tick_reg[17]}]  \
  [get_cells {pm_inst/tick_reg[18]}]  \
  [get_cells {pm_inst/tick_reg[19]}]  \
  [get_cells {pm_inst/tick_reg[20]}]  \
  [get_cells {pm_inst/tick_reg[21]}]  \
  [get_cells {pm_inst/tick_reg[22]}]  \
  [get_cells {pm_inst/tick_reg[23]}]  \
  [get_cells {pm_inst/tick_reg[24]}]  \
  [get_cells {pm_inst/tick_reg[25]}]  \
  [get_cells {pm_inst/tick_reg[26]}]  \
  [get_cells {pm_inst/tick_reg[27]}]  \
  [get_cells {pm_inst/tick_reg[28]}]  \
  [get_cells {pm_inst/tick_reg[29]}]  \
  [get_cells {pm_inst/tick_reg[30]}]  \
  [get_cells {pm_inst/tick_reg[31]}]  \
  [get_cells {pm_inst/timer_since_event_reg[0]}]  \
  [get_cells {pm_inst/timer_since_event_reg[1]}]  \
  [get_cells {pm_inst/timer_since_event_reg[2]}]  \
  [get_cells {pm_inst/timer_since_event_reg[3]}]  \
  [get_cells {pm_inst/timer_since_event_reg[4]}]  \
  [get_cells {pm_inst/timer_since_event_reg[5]}]  \
  [get_cells {pm_inst/timer_since_event_reg[6]}]  \
  [get_cells {pm_inst/timer_since_event_reg[7]}]  \
  [get_cells {pm_inst/timer_since_event_reg[8]}]  \
  [get_cells {pm_inst/timer_since_event_reg[9]}]  \
  [get_cells {pm_inst/timer_since_event_reg[10]}]  \
  [get_cells {pm_inst/timer_since_event_reg[11]}]  \
  [get_cells {pm_inst/timer_since_event_reg[12]}]  \
  [get_cells {pm_inst/timer_since_event_reg[13]}]  \
  [get_cells {pm_inst/timer_since_event_reg[14]}]  \
  [get_cells {pm_inst/timer_since_event_reg[15]}]  \
  [get_cells {pm_inst/timer_since_event_reg[16]}]  \
  [get_cells {pm_inst/timer_since_event_reg[17]}]  \
  [get_cells {pm_inst/timer_since_event_reg[18]}]  \
  [get_cells {pm_inst/timer_since_event_reg[19]}]  \
  [get_cells {pm_inst/timer_since_event_reg[20]}]  \
  [get_cells {pm_inst/timer_since_event_reg[21]}]  \
  [get_cells {pm_inst/timer_since_event_reg[22]}]  \
  [get_cells {pm_inst/timer_since_event_reg[23]}]  \
  [get_cells {pm_inst/timer_since_event_reg[24]}]  \
  [get_cells {pm_inst/timer_since_event_reg[25]}]  \
  [get_cells {pm_inst/timer_since_event_reg[26]}]  \
  [get_cells {pm_inst/timer_since_event_reg[27]}]  \
  [get_cells {pm_inst/timer_since_event_reg[28]}]  \
  [get_cells {pm_inst/timer_since_event_reg[29]}]  \
  [get_cells {pm_inst/timer_since_event_reg[30]}]  \
  [get_cells {pm_inst/timer_since_event_reg[31]}]  \
  [get_cells pm_inst/pace_pulse_reg]  \
  [get_cells lif_inst/spike_out_reg]  \
  [get_cells {rom_inst/data_reg[0]}]  \
  [get_cells {rom_inst/data_reg[11]}]  \
  [get_cells sample_clk_en_reg] ] -to [list \
  [get_cells {lif_inst/refract_cnt_reg[1]}]  \
  [get_cells {lif_inst/refract_cnt_reg[0]}]  \
  [get_cells {lif_inst/v_reg[10]}]  \
  [get_cells {lif_inst/v_reg[11]}]  \
  [get_cells {lif_inst/v_reg[12]}]  \
  [get_cells {lif_inst/v_reg[13]}]  \
  [get_cells {lif_inst/v_reg[14]}]  \
  [get_cells {lif_inst/v_reg[15]}]  \
  [get_cells {lif_inst/v_reg[16]}]  \
  [get_cells {lif_inst/v_reg[17]}]  \
  [get_cells {lif_inst/v_reg[18]}]  \
  [get_cells {lif_inst/v_reg[19]}]  \
  [get_cells {lif_inst/v_reg[1]}]  \
  [get_cells {lif_inst/v_reg[2]}]  \
  [get_cells {lif_inst/v_reg[3]}]  \
  [get_cells {lif_inst/v_reg[4]}]  \
  [get_cells {lif_inst/v_reg[0]}]  \
  [get_cells {lif_inst/v_reg[6]}]  \
  [get_cells {lif_inst/v_reg[7]}]  \
  [get_cells {lif_inst/v_reg[8]}]  \
  [get_cells {lif_inst/v_reg[9]}]  \
  [get_cells {lif_inst/v_reg[5]}]  \
  [get_cells {lif_inst/theta_reg[0]}]  \
  [get_cells {lif_inst/theta_reg[1]}]  \
  [get_cells {lif_inst/theta_reg[2]}]  \
  [get_cells {lif_inst/theta_reg[3]}]  \
  [get_cells {lif_inst/theta_reg[4]}]  \
  [get_cells {lif_inst/theta_reg[6]}]  \
  [get_cells {lif_inst/theta_reg[7]}]  \
  [get_cells {lif_inst/theta_reg[9]}]  \
  [get_cells {lif_inst/theta_reg[5]}]  \
  [get_cells {lif_inst/theta_reg[12]}]  \
  [get_cells {lif_inst/theta_reg[13]}]  \
  [get_cells {lif_inst/theta_reg[14]}]  \
  [get_cells {lif_inst/theta_reg[11]}]  \
  [get_cells {lif_inst/theta_reg[15]}]  \
  [get_cells {lif_inst/theta_reg[8]}]  \
  [get_cells {lif_inst/theta_reg[10]}]  \
  [get_cells {divcnt_reg[6]}]  \
  [get_cells {divcnt_reg[5]}]  \
  [get_cells {divcnt_reg[4]}]  \
  [get_cells {sample_addr_reg[3]}]  \
  [get_cells {divcnt_reg[3]}]  \
  [get_cells {sample_addr_reg[1]}]  \
  [get_cells {sample_addr_reg[2]}]  \
  [get_cells {divcnt_reg[2]}]  \
  [get_cells {sample_addr_reg[0]}]  \
  [get_cells {divcnt_reg[1]}]  \
  [get_cells {divcnt_reg[0]}]  \
  [get_cells {pm_inst/blank_until_reg[0]}]  \
  [get_cells {pm_inst/blank_until_reg[1]}]  \
  [get_cells {pm_inst/blank_until_reg[2]}]  \
  [get_cells {pm_inst/blank_until_reg[3]}]  \
  [get_cells {pm_inst/blank_until_reg[4]}]  \
  [get_cells {pm_inst/blank_until_reg[5]}]  \
  [get_cells {pm_inst/blank_until_reg[6]}]  \
  [get_cells {pm_inst/blank_until_reg[7]}]  \
  [get_cells {pm_inst/blank_until_reg[8]}]  \
  [get_cells {pm_inst/blank_until_reg[9]}]  \
  [get_cells {pm_inst/blank_until_reg[10]}]  \
  [get_cells {pm_inst/blank_until_reg[11]}]  \
  [get_cells {pm_inst/blank_until_reg[12]}]  \
  [get_cells {pm_inst/blank_until_reg[13]}]  \
  [get_cells {pm_inst/blank_until_reg[14]}]  \
  [get_cells {pm_inst/blank_until_reg[15]}]  \
  [get_cells {pm_inst/blank_until_reg[16]}]  \
  [get_cells {pm_inst/blank_until_reg[17]}]  \
  [get_cells {pm_inst/blank_until_reg[18]}]  \
  [get_cells {pm_inst/blank_until_reg[19]}]  \
  [get_cells {pm_inst/blank_until_reg[20]}]  \
  [get_cells {pm_inst/blank_until_reg[21]}]  \
  [get_cells {pm_inst/blank_until_reg[22]}]  \
  [get_cells {pm_inst/blank_until_reg[23]}]  \
  [get_cells {pm_inst/blank_until_reg[24]}]  \
  [get_cells {pm_inst/blank_until_reg[25]}]  \
  [get_cells {pm_inst/blank_until_reg[26]}]  \
  [get_cells {pm_inst/blank_until_reg[27]}]  \
  [get_cells {pm_inst/blank_until_reg[28]}]  \
  [get_cells {pm_inst/blank_until_reg[29]}]  \
  [get_cells {pm_inst/blank_until_reg[30]}]  \
  [get_cells {pm_inst/blank_until_reg[31]}]  \
  [get_cells {pm_inst/refract_until_reg[0]}]  \
  [get_cells {pm_inst/refract_until_reg[1]}]  \
  [get_cells {pm_inst/refract_until_reg[2]}]  \
  [get_cells {pm_inst/refract_until_reg[3]}]  \
  [get_cells {pm_inst/refract_until_reg[4]}]  \
  [get_cells {pm_inst/refract_until_reg[5]}]  \
  [get_cells {pm_inst/refract_until_reg[6]}]  \
  [get_cells {pm_inst/refract_until_reg[7]}]  \
  [get_cells {pm_inst/refract_until_reg[8]}]  \
  [get_cells {pm_inst/refract_until_reg[9]}]  \
  [get_cells {pm_inst/refract_until_reg[10]}]  \
  [get_cells {pm_inst/refract_until_reg[11]}]  \
  [get_cells {pm_inst/refract_until_reg[12]}]  \
  [get_cells {pm_inst/refract_until_reg[13]}]  \
  [get_cells {pm_inst/refract_until_reg[14]}]  \
  [get_cells {pm_inst/refract_until_reg[15]}]  \
  [get_cells {pm_inst/refract_until_reg[16]}]  \
  [get_cells {pm_inst/refract_until_reg[17]}]  \
  [get_cells {pm_inst/refract_until_reg[18]}]  \
  [get_cells {pm_inst/refract_until_reg[19]}]  \
  [get_cells {pm_inst/refract_until_reg[20]}]  \
  [get_cells {pm_inst/refract_until_reg[21]}]  \
  [get_cells {pm_inst/refract_until_reg[22]}]  \
  [get_cells {pm_inst/refract_until_reg[23]}]  \
  [get_cells {pm_inst/refract_until_reg[24]}]  \
  [get_cells {pm_inst/refract_until_reg[25]}]  \
  [get_cells {pm_inst/refract_until_reg[26]}]  \
  [get_cells {pm_inst/refract_until_reg[27]}]  \
  [get_cells {pm_inst/refract_until_reg[28]}]  \
  [get_cells {pm_inst/refract_until_reg[29]}]  \
  [get_cells {pm_inst/refract_until_reg[30]}]  \
  [get_cells {pm_inst/refract_until_reg[31]}]  \
  [get_cells {pm_inst/tick_reg[0]}]  \
  [get_cells {pm_inst/tick_reg[1]}]  \
  [get_cells {pm_inst/tick_reg[2]}]  \
  [get_cells {pm_inst/tick_reg[3]}]  \
  [get_cells {pm_inst/tick_reg[4]}]  \
  [get_cells {pm_inst/tick_reg[5]}]  \
  [get_cells {pm_inst/tick_reg[6]}]  \
  [get_cells {pm_inst/tick_reg[7]}]  \
  [get_cells {pm_inst/tick_reg[8]}]  \
  [get_cells {pm_inst/tick_reg[9]}]  \
  [get_cells {pm_inst/tick_reg[10]}]  \
  [get_cells {pm_inst/tick_reg[11]}]  \
  [get_cells {pm_inst/tick_reg[12]}]  \
  [get_cells {pm_inst/tick_reg[13]}]  \
  [get_cells {pm_inst/tick_reg[14]}]  \
  [get_cells {pm_inst/tick_reg[15]}]  \
  [get_cells {pm_inst/tick_reg[16]}]  \
  [get_cells {pm_inst/tick_reg[17]}]  \
  [get_cells {pm_inst/tick_reg[18]}]  \
  [get_cells {pm_inst/tick_reg[19]}]  \
  [get_cells {pm_inst/tick_reg[20]}]  \
  [get_cells {pm_inst/tick_reg[21]}]  \
  [get_cells {pm_inst/tick_reg[22]}]  \
  [get_cells {pm_inst/tick_reg[23]}]  \
  [get_cells {pm_inst/tick_reg[24]}]  \
  [get_cells {pm_inst/tick_reg[25]}]  \
  [get_cells {pm_inst/tick_reg[26]}]  \
  [get_cells {pm_inst/tick_reg[27]}]  \
  [get_cells {pm_inst/tick_reg[28]}]  \
  [get_cells {pm_inst/tick_reg[29]}]  \
  [get_cells {pm_inst/tick_reg[30]}]  \
  [get_cells {pm_inst/tick_reg[31]}]  \
  [get_cells {pm_inst/timer_since_event_reg[0]}]  \
  [get_cells {pm_inst/timer_since_event_reg[1]}]  \
  [get_cells {pm_inst/timer_since_event_reg[2]}]  \
  [get_cells {pm_inst/timer_since_event_reg[3]}]  \
  [get_cells {pm_inst/timer_since_event_reg[4]}]  \
  [get_cells {pm_inst/timer_since_event_reg[5]}]  \
  [get_cells {pm_inst/timer_since_event_reg[6]}]  \
  [get_cells {pm_inst/timer_since_event_reg[7]}]  \
  [get_cells {pm_inst/timer_since_event_reg[8]}]  \
  [get_cells {pm_inst/timer_since_event_reg[9]}]  \
  [get_cells {pm_inst/timer_since_event_reg[10]}]  \
  [get_cells {pm_inst/timer_since_event_reg[11]}]  \
  [get_cells {pm_inst/timer_since_event_reg[12]}]  \
  [get_cells {pm_inst/timer_since_event_reg[13]}]  \
  [get_cells {pm_inst/timer_since_event_reg[14]}]  \
  [get_cells {pm_inst/timer_since_event_reg[15]}]  \
  [get_cells {pm_inst/timer_since_event_reg[16]}]  \
  [get_cells {pm_inst/timer_since_event_reg[17]}]  \
  [get_cells {pm_inst/timer_since_event_reg[18]}]  \
  [get_cells {pm_inst/timer_since_event_reg[19]}]  \
  [get_cells {pm_inst/timer_since_event_reg[20]}]  \
  [get_cells {pm_inst/timer_since_event_reg[21]}]  \
  [get_cells {pm_inst/timer_since_event_reg[22]}]  \
  [get_cells {pm_inst/timer_since_event_reg[23]}]  \
  [get_cells {pm_inst/timer_since_event_reg[24]}]  \
  [get_cells {pm_inst/timer_since_event_reg[25]}]  \
  [get_cells {pm_inst/timer_since_event_reg[26]}]  \
  [get_cells {pm_inst/timer_since_event_reg[27]}]  \
  [get_cells {pm_inst/timer_since_event_reg[28]}]  \
  [get_cells {pm_inst/timer_since_event_reg[29]}]  \
  [get_cells {pm_inst/timer_since_event_reg[30]}]  \
  [get_cells {pm_inst/timer_since_event_reg[31]}]  \
  [get_cells pm_inst/pace_pulse_reg]  \
  [get_cells lif_inst/spike_out_reg]  \
  [get_cells {rom_inst/data_reg[0]}]  \
  [get_cells {rom_inst/data_reg[11]}]  \
  [get_cells sample_clk_en_reg] ]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks CLK] -add_delay -max 2.0 [get_ports RSTn]
set_input_delay -clock [get_clocks CLK] -add_delay -min 0.5 [get_ports RSTn]
set_output_delay -clock [get_clocks CLK] -add_delay -max 2.0 [get_ports LED_HEART]
set_output_delay -clock [get_clocks CLK] -add_delay -max 2.0 [get_ports LED_PACE]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.5 [get_ports LED_HEART]
set_output_delay -clock [get_clocks CLK] -add_delay -min 0.5 [get_ports LED_PACE]
set_max_fanout 8.000 [current_design]
set_max_transition 1.5 [current_design]
set_max_capacitance 0.3 [get_ports CLK]
set_max_capacitance 0.3 [get_ports RSTn]
set_ideal_network [get_ports CLK]
set_dont_touch_network [get_ports CLK]
set_wire_load_mode "enclosed"
set_clock_latency -max 0.5 [get_clocks CLK]
set_clock_latency -source 1.0 [get_clocks CLK]
set_clock_uncertainty -setup 0.5 [get_clocks CLK]
set_clock_uncertainty -hold 0.3 [get_clocks CLK]
